package ru.fink.parser.seman;

public enum SpeechPart {

    /**
     * Существительное
     */
    С,

    /**
     * Прилагательное
     */
    П,

    /**
     * Глагол
     */
    Г,

    /**
     * Числительное
     */
    ЧИСЛ,

    /**
     * Местоимение
     */
    МС,

    /**
     * Деепричастие
     */
    ДЕЕПРИЧАСТИЕ,

    /**
     * Причастие
     */
    ПРИЧАСТИЕ,

    /**
     * Наречие
     */
    Н,

    /**
     * Союз
     */
    СОЮЗ,

    /**
     * Глагол в инфинитивной форме
     */
    ИНФИНИТИВ,

    /**
     * Неопределённая часть речи
     */
    UNDEFINED;
}
